app/views/submissions/_index.html.erb

            <%= image_tag submission.user.avatar(:thumb) %><br>
            by <%= submission.user.first_name %><br />
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]