app/views/submissions/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
            <%= image_tag submission.user.avatar(:thumb) %><br>
            by <%= submission.user.first_name %><br />