app/views/submissions/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
    </label>
    <p>Donate to <%= @submission.user.first_name %> </p>

SELECT "comments".* FROM "comments" WHERE "comments"."submission_id" = ?  [["submission_id", 1]]
---
    </div>
    <% @submission.comments.each do |comment| %>