app/views/submissions/your_submission.html.erb

SELECT "submissions".* FROM "submissions" WHERE "submissions"."user_id" = ?  [["user_id", 1]]
---
<div class="row">
	<% current_user.submissions.each do |submission| %>