app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("comment_entry", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment_entry", "Comment on post"], ["created_at", "2016-02-25 16:09:45.298321"], ["updated_at", "2016-02-25 16:09:45.298321"]]