app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions"
---
  def index
    @submissions = Submission.all

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @comment = Comment.new

    @submission = Submission.find(params[:id])

SELECT  "submissions".* FROM "submissions"  ORDER BY "submissions"."cached_votes_score" DESC LIMIT 5
---
    def featured
    @submissions = Submission.all.order(:cached_votes_score => :desc).limit(5)

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @submission = Submission.find(params[:id])

INSERT INTO "submissions" ("title", "my_story", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @submission = Submission.new(submission_params)

    respond_to do |format|
      if @submission.save

UPDATE "submissions" SET "title" = ?, "my_story" = ?, "updated_at" = ? WHERE "submissions"."id" = ?
---
  def update

      id = params[:id].to_i
    session[:id] = User::ROLES.has_key?(id) ? id : 0
    flash[:success] = "Your new role #{User::ROLES[id]} was set!"
    redirect_to root_path
    respond_to do |format|

      if @submission.update(submission_params)

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 2]]
---
  def upvote
    @submission = Submission.find(params[:id])

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_submission
      @submission = Submission.find(params[:id])